Revit 2021.1 API
UnitUtils.Convert Method (Double, DisplayUnitType, DisplayUnitType)
 Converts a value from one display unit to another, such as square feet to square meters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `Convert(double, ForgeTypeId, ForgeTypeId)` overload instead.")]
public static double Convert(
	double value,
	DisplayUnitType currentDisplayUnit,
	DisplayUnitType desiredDisplayUnit
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `Convert(double, ForgeTypeId, ForgeTypeId)` overload instead.")> _
Public Shared Function Convert ( _
	value As Double, _
	currentDisplayUnit As DisplayUnitType, _
	desiredDisplayUnit As DisplayUnitType _
) As Double
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `Convert(double, ForgeTypeId, ForgeTypeId)` overload instead.")]
public:
static double Convert(
	double value,
	DisplayUnitType currentDisplayUnit,
	DisplayUnitType desiredDisplayUnit
)
Parameters
value
Type: System.Double
 The value to convert.
currentDisplayUnit
Type: Autodesk.Revit.DB.DisplayUnitType
 The current display unit.
desiredDisplayUnit
Type: Autodesk.Revit.DB.DisplayUnitType
 The desired display unit.
Return Value
 The converted value.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given value for value is not finite -or- currentDisplayUnit is an invalid display unit. See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits(). -or- desiredDisplayUnit is an invalid display unit. See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.ArgumentsInconsistentException |  currentDisplayUnit and desiredDisplayUnit have different dimensions.
See Also
UnitUtils Class
Convert Overload
Autodesk.Revit.DB Namespace